# Python - How to delete a column from pandas dataframe ?

In [19]:
import numpy as np
import pandas as pd

## Creating Scenario

In [29]:
df = pd.DataFrame({'mpg': {0: 21.0, 1: 21.0, 2: 22.8, 3: 21.4, 4: 18.7},
 'cyl': {0: 6, 1: 6, 2: 4, 3: 6, 4: 8},
 'disp': {0: 160, 1: 160, 2: 108, 3: 258, 4: 360},
 'hp': {0: 110, 1: 110, 2: 93, 3: 110, 4: 175},
 'gear': {0: 4, 1: 4, 2: 4, 3: 3, 4: 3}})
df

    mpg  cyl  disp   hp  gear
0  21.0    6   160  110     4
1  21.0    6   160  110     4
2  22.8    4   108   93     4
3  21.4    6   258  110     3
4  18.7    8   360  175     3

In [12]:
# Expected Output

    mpg  cyl  disp   hp
0  21.0    6   160  110
1  21.0    6   160  110
2  22.8    4   108   93
3  21.4    6   258  110
4  18.7    8   360  175

## Method 1

In [25]:
df_1 = df.drop("gear", axis = 1)
df_1

    mpg  cyl  disp   hp
0  21.0    6   160  110
1  21.0    6   160  110
2  22.8    4   108   93
3  21.4    6   258  110
4  18.7    8   360  175

In [27]:
df.drop("gear", axis=1, inplace = True)

In [28]:
df

    mpg  cyl  disp   hp
0  21.0    6   160  110
1  21.0    6   160  110
2  22.8    4   108   93
3  21.4    6   258  110
4  18.7    8   360  175

## Method 2

In [35]:
df_2 = df.drop(columns = "gear")
df_2

    mpg  cyl  disp   hp
0  21.0    6   160  110
1  21.0    6   160  110
2  22.8    4   108   93
3  21.4    6   258  110
4  18.7    8   360  175

In [37]:
df.drop(columns = "gear", inplace = True)

In [38]:
df

    mpg  cyl  disp   hp
0  21.0    6   160  110
1  21.0    6   160  110
2  22.8    4   108   93
3  21.4    6   258  110
4  18.7    8   360  175

## Summary
To remove a column from pandas dataframe

Method 1
- df = df.drop("column_name", axis = 1)
- df.drop("column_name", axis = 1, inplace = True)

Method 2
- df = df.drop(columns = "column_name")
- df.drop(columns = "column_name", inplace = True)

# Thanks You